fun main() {
    println(" ## Типы данных в Kotlin ## ")
    println("----------------------------------")

    // Целочисленные типы
    println("\n### Целочисленные типы ###")
    println(" - **Byte:** 8-битное знаковое целое число (-128..127)")
    println(" - **Short:** 16-битное знаковое целое число (-32 768..32 767)")
    println(" - **Int:** 32-битное знаковое целое число (-2 147 483 648..2 147 483 647)")
    println(" - **Long:** 64-битное знаковое целое число (-9 223 372 036 854 775 808..9 223 372 036 854 775 807)")
    println(" - **UInt:** 32-битное беззнаковое целое число (0..4 294 967 295)")
    println(" - **ULong:** 64-битное беззнаковое целое число (0..18 446 744 073 709 551 615)")

    // Числа с плавающей точкой
    println("\n### Числа с плавающей точкой ###")
    println(" - **Float:** 32-битное число с плавающей точкой (приблизительно 6-7 значащих цифр)")
    println(" - **Double:** 64-битное число с плавающей точкой (приблизительно 15-16 значащих цифр)")

    // Строки
    println("\n### Строки ###")
    println(" - **String:** Последовательность символов Unicode")

    // Булевы значения
    println("\n### Булевы значения ###")
    println(" - **Boolean:** Значение true или false")

    // Характеры
    println("\n### Характеры ###")
    println(" - **Char:** Один символ Unicode")

    // Массивы
    println("\n### Массивы ###")
    println(" - **Array:** Фиксированной длины упорядоченная коллекция элементов одного типа")

    // Списки
    println("\n### Списки ###")
    println(" - **List:** Упорядоченная коллекция элементов одного типа, mutable (может быть изменена)")

    // Наборы
    println("\n### Наборы ###")
    println(" - **Set:** Неупорядоченная коллекция уникальных элементов одного типа, mutable (может быть изменена)")
    println("----------------------------------")
}